export type SentenceExercise = {
  id: number;
  words: string[];
  correctOrder: string[];
};

export const sentenceExercises: SentenceExercise[] = [
  {
    id: 1,
    words: ["автобуспен", "Мен", "ертең", "барамын", "университетке"],
    correctOrder: [
      "Мен",
      "ертең",
      "университетке",
      "автобуспен",
      "барамын",
    ],
  },
  {
    id: 2,
    words: ["кітап", "кешке", "Мен", "оқимын", "үйде"],
    correctOrder: [
      "Мен",
      "кешке",
      "үйде",
      "кітап",
      "оқимын",
    ],
  },
  {
    id: 3,
    words: ["барады", "Әкем", "таңертең", "жұмысқа"],
    correctOrder: [
      "Әкем",
      "таңертең",
      "жұмысқа",
      "барады",
    ],
  },
  {
    id: 4,
    words: ["достарыммен", "Мен", "кездесемін", "ертең"],
    correctOrder: [
      "Мен",
      "ертең",
      "достарыммен",
      "кездесемін",
    ],
  },
  {
    id: 5,
    words: ["қазақ", "үйренемін", "Мен", "тілін", "күнде"],
    correctOrder: [
      "Мен",
      "күнде",
      "қазақ",
      "тілін",
      "үйренемін",
    ],
  },
];